openwch/arduino_core_ch32/system/CH32L10x/SRC/Peripheral/src/ch32l103_adc.c
    Refer_Volt = (s32)((TS_Val) & 0x0000FFFF);
    Refer_Temper = (s32)(((TS_Val) >> 16) & 0x0000FFFF);

    Temper = Refer_Temper - ((Value - Refer_Volt) * 10 + (k >> 1)) / k;

    return Temper;
}

/*********************************************************************
 * @fn      ADC_BufferCmd
 *
 * @brief   Enables or disables the ADCx buffer.
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void ADC_BufferCmd(ADC_TypeDef *ADCx, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        ADCx->CTLR1 |= (1 << 26);
    }
    else
    {
        ADCx->CTLR1 &= ~(1 << 26);
    }
}

/*********************************************************************
 * @fn      ADC_TKey_ChannelxMulShieldCmd
 *
 * @brief   Enables or disables TKey Multiplex shielding of the selected ADC channel.
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *          ADC_Channel - the ADC channel to configure.
 *            ADC_Channel_0 - ADC Channel0 selected.
 *            ADC_Channel_1 - ADC Channel1 selected.
 *            ADC_Channel_2 - ADC Channel2 selected.
 *            ADC_Channel_3 - ADC Channel3 selected.
 *            ADC_Channel_4 - ADC Channel4 selected.
 *            ADC_Channel_5 - ADC Channel5 selected.
 *            ADC_Channel_6 - ADC Channel6 selected.
 *            ADC_Channel_7 - ADC Channel7 selected.
 *            ADC_Channel_8 - ADC Channel8 selected.
 *            ADC_Channel_9 - ADC Channel9 selected.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void ADC_TKey_ChannelxMulShieldCmd(ADC_TypeDef *ADCx, uint8_t ADC_Channel, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        ADCx->CFG |= ((1<<9)<< ADC_Channel);
    }
    else
    {
        ADCx->CFG &= ~((1<<9)<< ADC_Channel);
    }
}

/*********************************************************************
 * @fn      ADC_TKey_MulShieldCmd
 *
 * @brief   Enables or disables the TKey Multiplex shielding.
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void ADC_TKey_MulShieldCmd(ADC_TypeDef *ADCx, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        ADCx->CFG |= (1 << 8);
    }
    else
    {
        ADCx->CFG &= ~(1 << 8);
    }
}

/*********************************************************************
 * @fn      ADC_DutyDelayCmd
 *
 * @brief   Enables or disables the Duty delay.
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void ADC_DutyDelayCmd(ADC_TypeDef *ADCx, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        ADCx->CFG |= (1 << 7);
    }
    else
    {
        ADCx->CFG &= ~(1 << 7);
    }
}

/*********************************************************************
 * @fn      ADC_FIFO_Cmd
 *
 * @brief   Enables or disables the FIFO.
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void ADC_FIFO_Cmd(ADC_TypeDef *ADCx, FunctionalState NewState)
{
    FLASH->KEYR = CFG_KEY1;
    FLASH->KEYR = CFG_KEY2;
    FLASH->MODEKEYR = CFG_KEY1;
    FLASH->OBKEYR = CFG_KEY2;
    while((*(vu32*)0x40022034) & (1<<29));  // wait unlock

    *(vu32*)0x4002202C |= (1<<9);     //offset calibration
    (*(vu32*)0x40022034) |= (1<<29);  //lock
    while((*(vu32*)0x40022034) & (1<<29) == 0); //wait lock

    if(NewState != DISABLE)
    {
        ADCx->CFG |= (1 << 6);
    }
    else
    {
        ADCx->CFG &= ~(1 << 6);
    }
}

/*********************************************************************
 * @fn      ADC_Sample_ModeConfig
 *
 * @brief   Configures the ADC Sample Mode.
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *          ADC_Sample_Mode - Sample Mode.
 *            ADC_Sample_NoOver_1M_Mode - sampling rate no over 1M(<=1M) mode.
 *            ADC_Sample_Over_1M_Mode - sampling rate over 1M(>1M) mode.
 *
 * @return  none
 */
void ADC_Sample_ModeConfig(ADC_TypeDef *ADCx, uint32_t ADC_Sample_Mode)
{
    ADCx->CFG &= ~ADC_Sample_Over_1M_Mode;
    ADCx->CFG |= ADC_Sample_Mode;
}

/*********************************************************************
 * @fn      ADC_OffsetCalibrationConfig
 *
 * @brief   Configures the Offset Calibration.
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *
 * @return  None
 */
void ADC_OffsetCalibrationConfig(ADC_TypeDef *ADCx)
{
    uint16_t tmp;

    tmp = ADC_Trim;
    ADCx->CFG &= ~0x0000000F;
    ADCx->CFG |= (uint32_t)((tmp & 0x07) | (((tmp & 0x8000)^0x8000) >> 12));
}

/*********************************************************************
 * @fn      ADC_AnalogWatchdogResetCmd
 *
 * @brief   Enables or disables the analog watch dog reset function.
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void ADC_AnalogWatchdogResetCmd(ADC_TypeDef *ADCx, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        ADCx->CFG |= (1 << 4);
    }
    else
    {
        ADCx->CFG &= ~(1 << 4);
    }
}

/*********************************************************************
 * @fn      Get_CalibrationValue
 *
 * @brief   Get ADCx Calibration Value.
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *
 * @return  CalibrationValue
 */
int16_t Get_CalibrationValue(ADC_TypeDef *ADCx)
{
    __IO uint8_t  i, j;
    uint16_t      buf[10];
    __IO uint16_t t;

    ADC1->CTLR2|=(7<<17);
    ADC_Cmd(ADC1, ENABLE);
    ADC_FIFO_Cmd(ADC1, ENABLE);
    ADC_ResetCalibration(ADC1);
    while(ADC_GetResetCalibrationStatus(ADC1));
    ADC_StartCalibration(ADC1);
    while(ADC_GetCalibrationStatus(ADC1));
    ADC_RegularChannelConfig(ADC1, ADC_Channel_CalInternal, 1, ADC_SampleTime_CyclesMode0);
    for(i = 0; i < 10; i++)
    {
        ADC_SoftwareStartConvCmd(ADC1, ENABLE);
        while(!ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC));
        buf[i] = ADC_GetConversionValue(ADC1);
    }
    for(i = 0; i < 10; i++)
    {
        for(j = 0; j < 9; j++)
        {
            if(buf[j] > buf[j + 1])
            {
                t = buf[j];
                buf[j] = buf[j + 1];
                buf[j + 1] = t;
            }
        }
    }

    t = 0;
    for(i = 0; i < 6; i++)
    {
        t += buf[i + 2];
    }
    t = (t / 6) + ((t % 6) / 3);
    ADC_Cmd(ADC1, DISABLE);
    return (int16_t)(2048 - (int16_t)t);
}


